#+TITLE:  Setting up a Nimbus slurm cluster
#+AUTHOR: Timo Lassmann
#+EMAIL:  timo.lassmann@telethonkids.org.au
#+DATE:   2018-05-24
#+LATEX_CLASS: report
#+OPTIONS:  toc:nil
#+OPTIONS: H:4
#+LATEX_CMD: xelatex

* Slurm from source:



#+BEGIN_SRC bash :noweb yes :tangle makeslurm_from_source.sh :shebang #!/usr/bin/env bash

# ----------------------------------------------------------------------
#  makeslurm_from_source.sh (tangled from: SETUP_NIMBUS_MINIMAL.ORG)
#  Descriptions: copied from: https://www.ni-sp.com/slurm-build-script-and-container-commercial-support/#h-automatic-slurm-build-script-for-ubuntu-18-04-and-20-04
# ----------------------------------------------------------------------
mkdir -p slurm-tmp
cd slurm-tmp
if [ "$VER" == "" ]; then
    export VER=20.02.6    # latest 20.02.XX version
    export VER=20.11.5
fi
# https://download.schedmd.com/slurm/slurm-20.02.3.tar.bz2
wget https://download.schedmd.com/slurm/slurm-$VER.tar.bz2

tar jxvf slurm-$VER.tar.bz2
cd slurm-$VER
# ./configure
./configure --prefix=/usr --sysconfdir=/etc/slurm --enable-pam --with-pam_dir=/lib/x86_64-linux-gnu/security/ --without-shared-libslurm
make
make contrib
sudo make install
cd ..
# fpm -s dir -t deb -v 1.0 -n slurm-$VER --prefix=/usr -C /tmp/slurm-build .
# echo Creating deb package for SLURM $VER
# fpm -s dir -t deb -v 1.0 -n slurm-$VER --prefix=/usr -C /usr .
# ----------------------------------------------------------------------
#+END_SRC

#+RESULTS:
Run and install: 
#+BEGIN_SRC bash
pdcp -a makeslurm_from_source.sh . 
pdsh -a ./makeslurm_from_source.sh  
pdsh -a slurmd --version
slurmd --version

sudo mkdir -p /etc/slurm /etc/slurm/prolog.d /etc/slurm/epilog.d /var/spool/slurm/ctld /var/spool/slurm/d /var/log/slurm
sudo chown slurm /var/spool/slurm/ctld /var/spool/slurm/d /var/log/slurm

pdsh -a sudo mkdir -p /etc/slurm /etc/slurm/prolog.d /etc/slurm/epilog.d /var/spool/slurm/ctld /var/spool/slurm/d /var/log/slurm
pdsh -a sudo chown slurm /var/spool/slurm/ctld /var/spool/slurm/d /var/log/slurm
#+END_SRC

Create all auxillary directories:

#+BEGIN_SRC bash :noweb yes :tangle create_slurm_directories.sh :shebang #!/usr/bin/env bash

# ----------------------------------------------------------------------
#  create_slurm_directories.sh (tangled from: SETUP_NIMBUS_MINIMAL.ORG)
#  Descriptions: Creates / touches all files needed by the slurm daemon
# ----------------------------------------------------------------------

sudo mkdir -p /var/spool/slurm
sudo chown slurm:slurm /var/spool/slurm
sudo chmod 755 /var/spool/slurm
sudo mkdir -p /var/spool/slurm/slurmctld
sudo chown slurm:slurm /var/spool/slurm/slurmctld
sudo chmod 755 /var/spool/slurm/slurmctld
sudo mkdir -p /var/spool/slurm/cluster_state
sudo chown slurm:slurm /var/spool/slurm/cluster_state
sudo touch /var/log/slurmctld.log
sudo chown slurm:slurm /var/log/slurmctld.log
sudo touch /var/log/slurm_jobacct.log /var/log/slurm_jobcomp.log
sudo chown slurm: /var/log/slurm_jobacct.log /var/log/slurm_jobcomp.log
sudo touch /var/run/slurmctld.pid /var/run/slurmd.pid
sudo chown slurm:slurm /var/run/slurmctld.pid /var/run/slurmd.pid
sudo mkdir -p /etc/slurm/prolog.d /etc/slurm/epilog.d 

# ----------------------------------------------------------------------
#+END_SRC


#+BEGIN_SRC bash

./create_slurm_directories.sh
pdcp -a create_slurm_directories.sh .
pdsh -a ./create_slurm_directories.sh
#+END_SRC

#+BEGIN_SRC bash :noweb yes :tangle slurm.conf

# slurm.conf file generated by configurator.html.
# Put this file on all nodes of your cluster.
# See the slurm.conf man page for more information.
#
SlurmctldHost=node-1
MpiDefault=none
ProctrackType=proctrack/cgroup
ReturnToService=2
#SallocDefaultCommand=
SlurmctldPidFile=/var/run/slurmctld.pid
SlurmctldPort=6817
SlurmdPidFile=/var/run/slurmd.pid
SlurmdPort=6818
SlurmdSpoolDir=/var/spool/slurm/slurmd
SlurmUser=slurm
#SlurmdUser=slurm
#SrunEpilog=
#SrunProlog=
StateSaveLocation=/var/spool/slurm/
SwitchType=switch/none
#TaskEpilog=
TaskPlugin=task/affinity
#
# SCHEDULING
#DefMemPerCPU=0
#MaxMemPerCPU=0
#SchedulerTimeSlice=30
SchedulerType=sched/backfill
SelectType=select/cons_res
SelectTypeParameters=CR_Core_Memory

# LOGGING AND ACCOUNTING
#AccountingStorageEnforce=0
#AccountingStorageHost=
#AccountingStorageLoc=
#AccountingStoragePass=
#AccountingStoragePort=
AccountingStorageType=accounting_storage/none
#AccountingStorageUser=
#AccountingStoreJobComment=YES
ClusterName=cluster
#DebugFlags=
#JobCompHost=
#JobCompLoc=
#JobCompPass=
#JobCompPort=
JobCompType=jobcomp/none
#JobCompUser=
#JobContainerType=job_container/none
#JobAcctGatherFrequency=30
JobAcctGatherType=jobacct_gather/none
#SlurmctldDebug=info
SlurmctldLogFile=/var/log/slurmctld.log
SlurmdDebug=info
SlurmdLogFile=/var/log/slurmd.log
#SlurmSchedLogFile=
#SlurmSchedLogLevel=
#
#
# POWER SAVE SUPPORT FOR IDLE NODES (optional)
#SuspendProgram=
#ResumeProgram=
#SuspendTimeout=
#ResumeTimeout=
#ResumeRate=
#SuspendExcNodes=
#SuspendExcParts=
#SuspendRate=
#SuspendTime=
#
#
# COMPUTE NODES
NodeName=node-[2-6] CPUs=32 Boards=1 SocketsPerBoard=1 CoresPerSocket=16 ThreadsPerCore=2 RealMemory=128831
PartitionName=debug Nodes=node-[2-6] Default=YES MaxTime=INFINITE State=UP

#+END_SRC

Copy slurm config file into correct location 
#+BEGIN_SRC bash
sudo cp slurm.conf  /etc/slurm/slurm.conf
pdcp -a slurm.conf .
pdsh -a sudo cp slurm.conf  /etc/slurm/slurm.conf
#+END_SRC


